Autodesk.Revit.DB.ContFooting.FootingType
Retrieves an object that represents the type of the footing.
Remarks: The footing type can be used to access the multi layered structure of a footing.

Autodesk.Revit.DB.ContFooting
An object that represents a Continuous Footing within Autodesk Revit.